{% macro requests_returned_to_user(status_column) %}
  CASE
    WHEN TRIM({{ status_column }}) IN (
      'المستفيد',
      'في انتظار اعتماد المالك الجديد',
      'بانتظار اختيار مقدم الطلب لشركة سلامة - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'بانتظار اختيار مقدم الطلب لشركة سلامة و مصاعد - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'بانتظار اختيار مقدم الطلب لشركة مصاعد - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'بانتظار مقدم الطلب للتحديث - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'بانتظار مقدم الطلب للتحديث مع شركة السلامة - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'قيد المراجعة من المالك الجديد'
    ) THEN 1
    ELSE 0
  END
{% endmacro %}