{% macro requests_in_progress_baladi(status_column) %}
  CASE
    WHEN TRIM({{ status_column }}) IN (
      'الطلب لدى استقبال القرارات المساحية',
      'الطلب لدى مدقق الرخص الإنشائية',
      'الطلب لدى مشرف الرخص الإنشائية',
      'الطلب لدى مهندس الرخص الإنشائية',
      'الطلب لدى المساح/المهندس',
      'الطلب لدى مشرف القرارات المساحية',
      'الطلب لدى مشرف شهادات الاشغال',
      'بانتظار اعتماد البلدية',
      'رخصة استثنائية - رئيس البلدية',
      'رخصة استثنائية - مشرف الرخص',
      'رخصة قديمة - بإنتظار الإعتماد',
      'رخصة قديمة - تحت المعالجة',
      'رئيس البلدية',
      'استقبال الرخص التجارية',
      'لدى مراقب شهادة الامتثال',
      'مراقب الرخص التجارية',
      'مشرف الرخص',
      'يوجد ملاحظات رقابة لاحقة',
      'معدل',
      'تم انشاء الطلب',
      'في إنتظار استلام المساح',
      'في انتظار اعتماد طلب الفرز الرئيسي'
    ) THEN TRUE
    ELSE FALSE
  END
{% endmacro %}