{% macro requests_in_progress_external(status_column) %}
  CASE
    WHEN TRIM({{ status_column }}) IN (
      'الاستديو التصميمي بهيئات التطوير',
      'الطلب لدى استقبال الاستوديو التصميمي',
      'الطلب لدى مشرف الاستوديو التصميمي',
      'الطلب لدى مهندس الاستوديو التصميمي',
      'المكتب الهندسي مرحلة التعاقدات',
      'بانتظار استلام الطلب من شركة الفحص',
      'بانتظار اصدار وثيقة التأمين',
      'بانتظار موافقة الجهات الحكومية',
      'بانتظار نتائج التفتيش',
      'تم إرسال الطلب إلى المكتب الهندسي',
      'جارى المراجعة النهائية - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'جاري دراسة الطلب - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'رفض أولي  - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'في إنتظار الكشف - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'في إنتظار موافقة الدفاع المدني',
      'في إنتظار موعد - يرجى الإطلاع على التفاصيل في بوابة سلامـة',
      'مستلم من المكتب الهندسي',
      'مستلم من شركة الفحص'
    ) THEN TRUE
    ELSE FALSE
  END
{% endmacro %}